---
kind: property
id: P:Autodesk.Revit.DB.FaceArray.Size
source: html/efc0353b-413e-13bc-71c7-a87adb2d1be9.htm
---
# Autodesk.Revit.DB.FaceArray.Size Property

Returns the number of faces that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```